Update docs and migrations
